v2206/MSc_icedAirfoil/_legacy/_05deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    west
    {
        type            patch;
        nFaces          24;
        startFace       38637;
    }
    east
    {
        type            patch;
        nFaces          24;
        startFace       38661;
    }
    north
    {
        type            patch;
        nFaces          48;
        startFace       38685;
    }
    south
    {
        type            patch;
        nFaces          48;
        startFace       38733;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19282;
        startFace       38781;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19282;
        startFace       58063;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          748;
        startFace       77345;
    }
)

// ************************************************************************* //
